src/cf/InformationRegisters/НастройкиГенерацииШтамповЭППоВидамДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиГенерацииШтамповЭППоВидамДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиГенерацииШтамповЭП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиГенерацииШтамповЭППоВидамДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вернет настройку или Неопределено, если ее нет
//
//
// Параметры:
//  Объект - СправочникССылка.ДокументыПредприятия
//
// Возвращаемое значение:
//   СправочникССылка.НастройкиГенерацииШтамповЭП
//
Функция ПолучитьНастройку(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиГенерацииШтамповЭППоВидамДокументов.Настройка КАК Настройка
	|ИЗ
	|	РегистрСведений.НастройкиГенерацииШтамповЭППоВидамДокументов КАК НастройкиГенерацииШтамповЭППоВидамДокументов
	|ГДЕ
	|	НастройкиГенерацииШтамповЭППоВидамДокументов.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Настройка;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет запись в регистр.
//
// Параметры:
//  Объект - СправочникССылка.ДокументыПредприятия
//  Настройка - СправочникССылка.НастройкиГенерацииШтамповЭП
//
Процедура ДобавитьЗапись(Объект, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Объект;
	Запись.Настройка = Настройка;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра.
//
// Параметры:
//  Объект - СправочникССылка.ДокументыПредприятия
//
Процедура УдалитьЗапись(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
